app/views/posts/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]
---
					  	  <span class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></span>
					  	  <%= @post.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 1]]
---
					  	  <span class="glyphicon glyphicon-heart-empty" aria-hidden="true" ></span>
					  	  <%= @post.favorites.count %>

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."post_id" = ?  [["post_id", 1]]
---
		<ul class="container">
			<% @post.post_comments.each do |post_comment| %>