app/controllers/bookmarks_controller.rb

  def index
  	#@customer = current_customer
  	#@bookmarks = Bookmark.where(customer_id: current_customer.id)
  	@bookmarks = Bookmark.where(customer_id: current_customer.id)
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."customer_id" = ?  [["customer_id", 1]]

  def create
  	bookmark = current_customer.bookmarks.build(post_id: params[:post_id])
  	bookmark.customer_id = current_customer.id
    bookmark.save!
---
INSERT INTO "bookmarks" ("customer_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["customer_id", 1], ["post_id", 1], ["created_at", "2021-01-17 13:57:29.287249"], ["updated_at", "2021-01-17 13:57:29.287249"]]

  def destroy
  	current_customer.bookmarks.find_by(id: params[:id]).destroy!
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."customer_id" = ? AND "bookmarks"."id" = ? LIMIT ?  [["customer_id", 1], ["id", 1], ["LIMIT", 1]]