app/controllers/customers_controller.rb

  def mypage
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @customer = Customer.find(params[:id])
    if @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "customers" SET "profile_image_id" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["profile_image_id", "54121aa759b321ba24f690e730c48041e221b89b4538f792dc40add15565"], ["updated_at", "2021-01-17 14:13:59.884946"], ["id", 2]]