app/controllers/favorites_controller.rb

  def create
  	post = Post.find(params[:post_id])
	favorite = current_customer.favorites.new(post_id: post.id)
	favorite.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("customer_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["customer_id", 1], ["post_id", 1], ["created_at", "2021-01-17 13:58:32.088888"], ["updated_at", "2021-01-17 13:58:32.088888"]]