app/controllers/homes_controller.rb

  def top
  	@posts = Post.order(created_at: :desc).limit(10)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ?  [["LIMIT", 10]]