app/controllers/post_comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("customer_id", "post_id", "created_at", "updated_at", "comment") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["post_id", 1], ["created_at", "2021-01-17 13:58:46.362284"], ["updated_at", "2021-01-17 13:58:46.362284"], ["comment", "コメント\r\n"]]
---
	def create
		post = Post.find(params[:post_id])
		comment = current_customer.post_comments.new(post_comment_params)
		comment.post_id = post.id
		comment.save