app/controllers/posts_controller.rb

  def all
  	@posts = Post.where(customer_id: params[:customer_id])
    @customer = Customer.find(params[:customer_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."customer_id" = ?  [["customer_id", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def ranking
    @posts = Post.joins(:favorites).group("favorites.post_id").order("count(favorites.id) desc").limit(10)
---
SELECT  "posts".* FROM "posts" INNER JOIN "favorites" ON "favorites"."post_id" = "posts"."id" GROUP BY favorites.post_id ORDER BY count(favorites.id) desc LIMIT ?  [["LIMIT", 10]]

  def create
  	@post = current_customer.posts.new(post_params)
  	@post.rate = 0 if @post.rate.blank? #後置if
  	if @post.save
---
INSERT INTO "posts" ("customer_id", "title", "body", "product_name", "product_image_id", "bay_day", "price", "created_at", "updated_at", "rate") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
  	@post = Post.find(params[:id])
  	@customer = Customer.find_by(id: @post.customer_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
  	@post = Post.find(params[:id])
  	if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "product_image_id" = ?, "rate" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "とてもいいです！オススメ！"], ["product_image_id", "a0c08c56da28737988525aa5b7b653517deb90bef40f1b66c18bacc550c0"], ["rate", 4.5], ["updated_at", "2021-01-17 14:17:22.607729"], ["id", 1]]